Spectrewolf777/Stm32l4-Watch/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define rtc_int_Pin GPIO_PIN_13
#define rtc_int_GPIO_Port GPIOC
#define rtc_int_EXTI_IRQn EXTI15_10_IRQn
#define DisplayEnable_Pin GPIO_PIN_0
#define DisplayEnable_GPIO_Port GPIOA
#define BL_Pin GPIO_PIN_2
#define BL_GPIO_Port GPIOA
#define IMU_INT1_Pin GPIO_PIN_3
#define IMU_INT1_GPIO_Port GPIOA
#define IMU_INT1_EXTI_IRQn EXTI3_IRQn
#define TP_RST_Pin GPIO_PIN_4
#define TP_RST_GPIO_Port GPIOA
#define TP_INT_Pin GPIO_PIN_0
#define TP_INT_GPIO_Port GPIOB
#define TP_INT_EXTI_IRQn EXTI0_IRQn
#define CS_Pin GPIO_PIN_2
#define CS_GPIO_Port GPIOB
#define RST_Pin GPIO_PIN_8
#define RST_GPIO_Port GPIOA
#define DC_Pin GPIO_PIN_10
#define DC_GPIO_Port GPIOA
#define SDEnable_Pin GPIO_PIN_15
#define SDEnable_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
